In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'Name':['ajantha', 'devi'], 'age':[45,67]})
df2 = pd.DataFrame({'Name':['steve', 'jobs'], 'age':[54,76]})

In [5]:
df1

      Name  age
0  ajantha   45
1     devi   67

In [7]:
df2

    Name  age
0  steve   54
1   jobs   76

In [9]:
# concat
pd.concat([df1,df2],axis = 1) # col

      Name  age   Name  age
0  ajantha   45  steve   54
1     devi   67   jobs   76

In [13]:
df3  = pd.concat([df1,df2],axis = 0) # row
df3

      Name  age
0  ajantha   45
1     devi   67
0    steve   54
1     jobs   76

In [15]:
df4 = pd.DataFrame({'Name':['vicky', 'micky'], 'age':[28,77], 'hobby':['reading', 'swimming']})
df4

    Name  age     hobby
0  vicky   28   reading
1  micky   77  swimming

In [17]:
pd.concat([df3,df4],join = 'outer',ignore_index = True)

      Name  age     hobby
0  ajantha   45       NaN
1     devi   67       NaN
2    steve   54       NaN
3     jobs   76       NaN
4    vicky   28   reading
5    micky   77  swimming

In [19]:
pd.concat([df3,df4],join = 'inner',ignore_index = True)

      Name  age
0  ajantha   45
1     devi   67
2    steve   54
3     jobs   76
4    vicky   28
5    micky   77

In [23]:
pd.concat([df3,df4],axis = 0, ignore_index = True)

      Name  age     hobby
0  ajantha   45       NaN
1     devi   67       NaN
2    steve   54       NaN
3     jobs   76       NaN
4    vicky   28   reading
5    micky   77  swimming

In [25]:
df3

      Name  age
0  ajantha   45
1     devi   67
0    steve   54
1     jobs   76

In [27]:
df5  = pd.concat([df1,df2],axis = 0, ignore_index = True) # row
df5

      Name  age
0  ajantha   45
1     devi   67
2    steve   54
3     jobs   76

In [29]:
# merge

Size = pd.DataFrame({'color':['Red','blue','yellow'], 'Size' : ['M', 'S', 'M']})
Gender = pd.DataFrame({'color':['Red','Green', 'yellow'],'Gender':['M','F','F']})

In [31]:
Size

    color Size
0     Red    M
1    blue    S
2  yellow    M

In [33]:
Gender

    color Gender
0     Red      M
1   Green      F
2  yellow      F

In [35]:
pd.merge(Size,Gender, how = 'inner') # intersection => common

    color Size Gender
0     Red    M      M
1  yellow    M      F

In [39]:
pd.merge(Size,Gender, how = 'outer') # union

    color Size Gender
0   Green  NaN      F
1     Red    M      M
2    blue    S    NaN
3  yellow    M      F

In [41]:
pd.merge(Size,Gender, how = 'left')

    color Size Gender
0     Red    M      M
1    blue    S    NaN
2  yellow    M      F

In [43]:
pd.merge(Size,Gender, how = 'right')

    color Size Gender
0     Red    M      M
1   Green  NaN      F
2  yellow    M      F